#+title: Sprint Backlog 09
#+options: date:nil toc:nil author:nil num:nil
#+todo: STARTED | COMPLETED CANCELLED POSTPONED
#+tags: { story(s) spike(p) }

* Mission

- Create a simple mesh.

* Stories

** Active

#+begin: clocktable :maxlevel 3 :scope subtree :indent nil :emphasize nil :scope file :narrow 75 :formula %
#+CAPTION: Clock summary at [2016-04-26 Tue 16:38]
| <75>                                                                        |         |       |      |       |
| Headline                                                                    | Time    |       |      |     % |
|-----------------------------------------------------------------------------+---------+-------+------+-------|
| *Total time*                                                                | *21:12* |       |      | 100.0 |
|-----------------------------------------------------------------------------+---------+-------+------+-------|
| Stories                                                                     | 21:12   |       |      | 100.0 |
| Active                                                                      |         | 21:12 |      | 100.0 |
| STARTED Journal club and lectures                                           |         |       | 1:00 |   4.7 |
| STARTED Socialising                                                         |         |       | 1:00 |   4.7 |
| COMPLETED Build a tree from an SWC models                                   |         |       | 7:30 |  35.4 |
| STARTED Create a polygon mesh with the simple SWC file                      |         |       | 4:03 |  19.1 |
| STARTED Sprint review                                                       |         |       | 0:31 |   2.4 |
| STARTED Read and present McGregor's paper                                   |         |       | 7:08 |  33.6 |
#+TBLFM: $5='(org-clock-time% @3$2 $2..$4);%.1f
#+end:

*** COMPLETED Sprint and product backlog grooming                     :story:
    CLOSED: [2016-07-04 Mon 15:05]

Updates to sprint and product backlog.

*** COMPLETED Journal club and lectures                               :story:
    CLOSED: [2016-07-04 Mon 15:05]
    CLOCK: [2016-04-15 Fri 16:00]--[2016-04-15 Fri 17:00] =>  1:00

Time spent in generic tasks.

- sorting out supervision.

*** COMPLETED Socialising                                             :story:
    CLOSED: [2016-07-04 Mon 15:05]
    CLOCK: [2016-04-15 Fri 17:00]--[2016-04-15 Fri 18:00] =>  1:00

Any events during work hours not directly connected to work.

*** COMPLETED Build a tree from an SWC models                         :story:
    CLOSED: [2016-04-20 Wed 16:23]
    CLOCK: [2016-04-20 Wed 14:01]--[2016-04-20 Wed 16:22] =>  2:21
    CLOCK: [2016-04-18 Mon 13:56]--[2016-04-18 Mon 17:38] =>  3:42
    CLOCK: [2016-04-15 Fri 14:31]--[2016-04-15 Fri 15:58] =>  1:27

In order to convert the SWC model into a CSG representation, we need
it to be in tree form. Create a tree builder in SWC to generate this
representation and add all associated types. Add basic tests.

*** POSTPONED Create a polygon mesh with the simple SWC file          :story:
    CLOSED: [2016-07-04 Mon 15:05]
    CLOCK: [2016-04-22 Fri 17:10]--[2016-04-22 Fri 18:02] =>  0:52
    CLOCK: [2016-04-22 Fri 14:29]--[2016-04-22 Fri 16:01] =>  1:32
    CLOCK: [2016-04-20 Wed 16:23]--[2016-04-20 Wed 18:02] =>  1:39

We need to create a polygon mesh representation of the simple ball and
stick SWC file.

- [[http://doc.cgal.org/latest/Mesh_3/index.html][CGAL 4.7 - 3D Mesh Generation]]

Notes:

- Delaunay refinement:
- restricted Delaunay triangulation:
- requirements on the input domain: The domain to be meshed is assumed
  to be bounded and representable as a pure 3D complex. A 3D complex
  is a set of faces with dimension 0, 1, 2 and 3 such that all faces
  are pairwise interior disjoint, and the boundary of each face of the
  complex is the union of faces of the complex. The 3D complex is
  pure, meaning that each face is included in a face of dimension 3,
  so that the complex is entirely described by the set of its 3D faces
  and their subfaces.
- output mesh: This means that each subdomain is approximated by the
  union of the tetrahedral cells whose circumcenters are located
  inside the domain (or subdomain). Each surface patch is approximated
  by the union of the Delaunay mesh facets whose dual Voronoi edges
  intersect the surface patch. Such mesh facets are called surface
  facets in the following. The 1-dimensional exposed features are
  approximated by sequences of mesh edges and the 0-dimensional
  exposed features are represented by mesh vertices.
- The mesh density refers to the number of mesh vertices and cells,
  i.e. to the complexity of the mesh. The mesh quality referred to
  here is measured by the radius edge ratio of surface facets end mesh
  cells, where the radius edge ratio of a simplex (triangle or
  tetrahedron) is the the ratio between its circumradius and its
  shortest edge.
- [[http://cgal-discuss.949826.n4.nabble.com/newbie-question-3D-meshing-of-geometric-objects-cylinder-box-etc-amp-boolean-ops-td4657492.html][Meshing of geometric objects (cylinder, box, etc) & boolean ops]]:
  CGAL allows to mesh a domain whose boundary is defined by one of
  several implicit surfaces. See the example in subsection 3.5.2 of
  chapter 3D Mesh Generation of the user manual. However if the
  surfaces intersect and if you want the mesh to precisely reproduce
  the intersection curves you have to previously detect those
  intersections.
- [[http://stackoverflow.com/questions/33197841/create-parameterized-3d-primitives-with-cgal][Create parameterized 3D primitives with cgal]]

*** COMPLETED Sprint review                                           :story:
    CLOSED: [2016-07-04 Mon 15:05]
    CLOCK: [2016-04-15 Fri 14:00]--[2016-04-15 Fri 14:31] =>  0:31

Review of the sprint.

*** COMPLETED Read and present McGregor's paper                       :story:
    CLOSED: [2016-07-04 Mon 15:05]
    CLOCK: [2016-04-26 Tue 13:30]--[2016-04-26 Tue 16:38] =>  3:08
    CLOCK: [2016-04-25 Mon 14:03]--[2016-04-25 Mon 18:03] =>  4:00

Now we understand the need for a CSG representation, McGregor's paper
on CTNG makes a lot more sense. Parse the paper.

Notes:

- simply abutting frusta as is often done for pure electrophysiology
  simulations is inadequate

** Deprecated
*** CANCELLED Create a blog post on basic maths terminology           :story:
    CLOSED: [2016-03-14 Mon 11:05]

*Rationale*: Actually it seems ScratchPixel is already a good resource
for this so there is no need to create a post on this.

Now we understood the basics, we should apply the usual Feynman
technique and write a blog post about it.
